'use strict'

/*
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */

// const a = [1, 2, 3]
// const b = a
// a.push(10)
// console.log(a, b);

// console.log(a === b);
// console.log([1, 2] === [1, 2]);





// const a = [1, 2, 3];
// const b = a; // b тепер посилається на той самий масив, що й a

// console.log("a", a); // [1, 2, 3]
// console.log("b", b); // [1, 2, 3]

// a[0] = 500; // Змінюємо елемент масиву через a

// console.log("a", a); // [500, 2, 3]
// console.log("b", b); // [500, 2, 3] - змінився, бо це той самий масив

// console.log(a === b); // true - однакові посилання

// console.log([] === []); // false - різні масиви (різні посилання)
// console.log([1, 2, 3] == [1, 2, 3]); // false - різні масиви (різні посилання)


